// demo05.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"

void main()
{
	int a[3]={1,2,3};
	printf("%d\n",a[1]);
	printf("%d\n",*(a+1));

   //二维数组，本质是二重指针，也就是指针的指针
   //保存的地址的地址
	int b[5][5]={
		{1,2,3,4,5},
		{6,7,8,9,10},
		{11,12,13,14,15},
		{16,17,18,19,20},
		{21,22,23,24,25},
	};
	 
	//常规的通用
	  printf("%d\n",b[3][4]);
	  
		  //先找到第4列的地址，然后向上错上5地址
	  printf("%d\n",*(b[3]+4));
	  //根据整个二位数组的首地址，找到第三4列的地址，然后找到1列的第五个元素。
	  printf("%d\n",*(*(b+3)+4));
}
//b其实是个二重指针
//b[0] b[1] b[2] b[3] b[4] b[5]  一重指针
//b[]+x